dwgan/STKNX_ChargeStation/source/drivers/AD/STM32F10XX/include/Stm32F10XX_adc.h
/********************************************************************
* Right reserved (C 2016) for *********** company.
*
* File Name        : Stm32F10XX_adc.h
*
* File Description : Header file for stm32f10xx adc definition.
*
* Other Description: No.
*
* Version          : 1.00
*
* Author           : 
*
* Data             : 2016.7.28
*
* Modification Rec.:
*   Modify Data    : 2016.7.28
*   Operator       :
*   Version        : 1.00
*   Action         : Creation.
*
********************************************************************/


#ifndef _STM32F10XX_ADC_H_
#define _STM32F10XX_ADC_H_

#ifdef __cplusplus
extern "C" {
#endif

#define MAX_ADC_DEVICE_NUM                  (2)                                /* Max number of adc           */
#define SYSCLK_FREQ_24M                     24000000
#define SYSCLK_FREQ_36M                     36000000
#define SYSCLK_FREQ_48M                     48000000
#define SYSCLK_FREQ_56M                     56000000
#define SYSCLK_FREQ_72M                     72000000

/* ADC parameter data field position definition   */
#define ADC_DEV_NO_POS                      (1)                                /* Field of adc nubmer         */
#define ADC_PORT_CH_POS                     (2)                                /* Field of Port channel       */
#define ADC_START_POS                       (3)                                /* Field of start/stop         */
#define ADC_SAMPLE_CNT                      (4)                                /* Field of sampling count     */

/* ADC number */
#define ADC_1                                  (1)
#define ADC_2                                  (2)

/* ADC base addresses */
#define ADC1_BASE                           ((T_ADC_MEM_MAP)0x40012400u)       /* Address of base register for ADC1 */
#define ADC2_BASE                           ((T_ADC_MEM_MAP)0x40012800u)       /* Address of base register for ADC2 */

#define ADCX_BASE(n)                        ((T_ADC_MEM_MAP)(0x40012400u + 0x400 * (n - 1)))

/* ADC Register accessors */
#define ADCX_SR(n)                          (ADCX_BASE(n)->SR)                 /* Address of Status register                       */
#define ADCX_CR1(n)                         (ADCX_BASE(n)->CR1)                /* Address of Control register 1                    */
#define ADCX_CR2(n)                         (ADCX_BASE(n)->CR2)                /* Address of Control regitset 2                    */
#define ADCX_SMPR1(n)                       (ADCX_BASE(n)->SMPR1)              /* Address of Sample time register 1                */
#define ADCX_SMPR2(n)                       (ADCX_BASE(n)->SMPR2)              /* Address of Sample time register 2                */
#define ADCX_JOFR1(n)                       (ADCX_BASE(n)->JOFR1)              /* Address of Inject channel data offset register 1 */
#define ADCX_JOFR2(n)                       (ADCX_BASE(n)->JOFR2)              /* Address of Inject channel data offset register 2 */
#define ADCX_JOFR3(n)                       (ADCX_BASE(n)->JOFR3)              /* Address of Inject channel data offset register 3 */
#define ADCX_JOFR4(n)                       (ADCX_BASE(n)->JOFR4)              /* Address of Inject channel data offset register 4 */
#define ADCX_HTR(n)                         (ADCX_BASE(n)->HTR)                /* Address of Watchdog high threshold register 1    */
#define ADCX_LTR(n)                         (ADCX_BASE(n)->LTR)                /* Address of Watchdog low threshold register 2     */
#define ADCX_SQR1(n)                        (ADCX_BASE(n)->SQR1)               /* Address of Regular sequence register 1           */
#define ADCX_SQR2(n)                        (ADCX_BASE(n)->SQR2)               /* Address of Regular sequence register 2           */
#define ADCX_SQR3(n)                        (ADCX_BASE(n)->SQR3)               /* Address of Regular sequence register 3           */
#define ADCX_JSQR(n)                        (ADCX_BASE(n)->JSQR)               /* Address of Inject sequence register              */
#define ADCX_JDR1(n)                        (ADCX_BASE(n)->JDR1)               /* Address of Inject data register 1                */
#define ADCX_JDR2(n)                        (ADCX_BASE(n)->JDR2)               /* Address of Inject data register 2                */
#define ADCX_JDR3(n)                        (ADCX_BASE(n)->JDR3)               /* Address of Inject data register 3                */
#define ADCX_JDR4(n)                        (ADCX_BASE(n)->JDR4)               /* Address of Inject data register 4                */
#define ADCX_DR(n)                          (ADCX_BASE(n)->DR)                 /* Address of Regular data register                 */


/* ADC Register accessors for each ADC */
/* ADC1 */
#define ADC1_SR                             (ADCX_SR(ADC_1))                   /* Address of Status register                       */
#define ADC1_CR1                            (ADCX_CR1(ADC_1))                  /* Address of Control register 1                    */
#define ADC1_CR2                            (ADCX_CR2(ADC_1))                  /* Address of Control regitset 2                    */
#define ADC1_SMPR1                          (ADCX_SMPR1(ADC_1))                /* Address of Sample time register 1                */
#define ADC1_SMPR2                          (ADCX_SMPR2(ADC_1))                /* Address of Sample time register 2                */
#define ADC1_JOFR1                          (ADCX_JOFR1(ADC_1))                /* Address of Inject channel data offset register 1 */
#define ADC1_JOFR2                          (ADCX_JOFR2(ADC_1))                /* Address of Inject channel data offset register 2 */
#define ADC1_JOFR3                          (ADCX_JOFR3(ADC_1))                /* Address of Inject channel data offset register 3 */
#define ADC1_JOFR4                          (ADCX_JOFR4(ADC_1))                /* Address of Inject channel data offset register 4 */
#define ADC1_HTR                            (ADCX_HTR(ADC_1))                  /* Address of Watchdog high threshold register 1    */
#define ADC1_LTR                            (ADCX_LTR(ADC_1))                  /* Address of Watchdog low threshold register 2     */
#define ADC1_SQR1                           (ADCX_SQR1(ADC_1))                 /* Address of Regular sequence register 1           */
#define ADC1_SQR2                           (ADCX_SQR2(ADC_1))                 /* Address of Regular sequence register 2           */
#define ADC1_SQR3                           (ADCX_SQR3(ADC_1))                 /* Address of Regular sequence register 3           */
#define ADC1_JSQR                           (ADCX_JSQR(ADC_1))                 /* Address of Inject sequence register              */
#define ADC1_JDR1                           (ADCX_JDR1(ADC_1))                 /* Address of Inject data register 1                */
#define ADC1_JDR2                           (ADCX_JDR2(ADC_1))                 /* Address of Inject data register 2                */
#define ADC1_JDR3                           (ADCX_JDR3(ADC_1))                 /* Address of Inject data register 3                */
#define ADC1_JDR4                           (ADCX_JDR4(ADC_1))                 /* Address of Inject data register 4                */
#define ADC1_DR                             (ADCX_DR(ADC_1))                   /* Address of Regular data register                 */

/* ADC2 */
#define ADC2_SR                             (ADCX_SR(ADC_2))                   /* Address of Status register                       */
#define ADC2_CR1                            (ADCX_CR1(ADC_2))                  /* Address of Control register 1                    */
#define ADC2_CR2                            (ADCX_CR2(ADC_2))                  /* Address of Control regitset 2                    */
#define ADC2_SMPR1                          (ADCX_SMPR1(ADC_2))                /* Address of Sample time register 1                */
#define ADC2_SMPR2                          (ADCX_SMPR2(ADC_2))                /* Address of Sample time register 2                */
#define ADC2_JOFR1                          (ADCX_JOFR1(ADC_2))                /* Address of Inject channel data offset register 1 */
#define ADC2_JOFR2                          (ADCX_JOFR2(ADC_2))                /* Address of Inject channel data offset register 2 */
#define ADC2_JOFR3                          (ADCX_JOFR3(ADC_2))                /* Address of Inject channel data offset register 3 */
#define ADC2_JOFR4                          (ADCX_JOFR4(ADC_2))                /* Address of Inject channel data offset register 4 */
#define ADC2_HTR                            (ADCX_HTR(ADC_2))                  /* Address of Watchdog high threshold register 1    */
#define ADC2_LTR                            (ADCX_LTR(ADC_2))                  /* Address of Watchdog low threshold register 2     */
#define ADC2_SQR1                           (ADCX_SQR1(ADC_2))                 /* Address of Regular sequence register 1           */
#define ADC2_SQR2                           (ADCX_SQR2(ADC_2))                 /* Address of Regular sequence register 2           */
#define ADC2_SQR3                           (ADCX_SQR3(ADC_2))                 /* Address of Regular sequence register 3           */
#define ADC2_JSQR                           (ADCX_JSQR(ADC_2))                 /* Address of Inject sequence register              */
#define ADC2_JDR1                           (ADCX_JDR1(ADC_2))                 /* Address of Inject data register 1                */
#define ADC2_JDR2                           (ADCX_JDR2(ADC_2))                 /* Address of Inject data register 2                */
#define ADC2_JDR3                           (ADCX_JDR3(ADC_2))                 /* Address of Inject data register 3                */
#define ADC2_JDR4                           (ADCX_JDR4(ADC_2))                 /* Address of Inject data register 4                */
#define ADC2_DR                             (ADCX_DR(ADC_2))                   /* Address of Regular data register                 */



