dwgan/STKNX_ChargeStation/source/drivers/AD/STM32F10XX/include/Stm32F10XX_adc.h
/* Bit definition for ADC_SR register */
#define ADC_SR_AWD_POS                      (0U)                               
#define ADC_SR_AWD_MASK                     (0x00000001)                       /* 0x00000001                 */
#define ADC_SR_AWD                          (ADC_SR_AWD_MASK)                  /* ADC analog watchdog 1 flag */
#define ADC_SR_EOS_POS                      (1U)                               
#define ADC_SR_EOS_MASK                     (0x00000002)                       /* 0x00000002                                         */
#define ADC_SR_EOS                          (ADC_SR_EOS_MASK)                  /* ADC group regular end of sequence conversions flag */
#define ADC_SR_JEOS_POS                     (2U)                               
#define ADC_SR_JEOS_MASK                    (0x00000004)                       /* 0x00000004                                          */
#define ADC_SR_JEOS                         (ADC_SR_JEOS_MASK                  /* ADC group injected end of sequence conversions flag */
#define ADC_SR_JSTRT_POS                    (3U)                               
#define ADC_SR_JSTRT_MASK                   (0x00000008)                       /* 0x00000008                               */
#define ADC_SR_JSTRT                        (ADC_SR_JSTRT_MASK)                /* ADC group injected conversion start flag */
#define ADC_SR_STRT_POS                     (4U)                               
#define ADC_SR_STRT_MASK                    (0x00000010)                       /* 0x00000010                              */
#define ADC_SR_STRT                         (ADC_SR_STRT_MASK)                 /* ADC group regular conversion start flag */

/* Legacy defines */
#define ADC_SR_EOC                          (ADC_SR_EOS)
#define ADC_SR_JEOC                         (ADC_SR_JEOS)

/* Bit definition for ADC_CR1 register */
#define ADC_CR1_AWDCH_POS                   (0U)                               
#define ADC_CR1_AWDCH_MASK                  (0x0000001F)                       /* 0x0000001F                                        */
#define ADC_CR1_AWDCH                       (ADC_CR1_AWDCH_MASK)               /* ADC analog watchdog 1 monitored channel selection */
#define ADC_CR1_AWDCH_0                     (0x00000001)                       /* 0x00000001                                        */
#define ADC_CR1_AWDCH_1                     (0x00000002)                       /* 0x00000002                                        */
#define ADC_CR1_AWDCH_2                     (0x00000004)                       /* 0x00000004                                        */
#define ADC_CR1_AWDCH_3                     (0x00000008)                       /* 0x00000008                                        */
#define ADC_CR1_AWDCH_4                     (0x00000010)                       /* 0x00000010                                        */

#define ADC_CR1_EOSIE_POS                   (5U)                               
#define ADC_CR1_EOSIE_MASK                  (0x00000020)                       /* 0x00000020                                              */
#define ADC_CR1_EOSIE                       (ADC_CR1_EOSIE_MASK)               /* ADC group regular end of sequence conversions interrupt */
#define ADC_CR1_AWDIE_POS                   (6U)                               
#define ADC_CR1_AWDIE_MASK                  (0x00000040)                       /* 0x00000040                      */
#define ADC_CR1_AWDIE                       (ADC_CR1_AWDIE_MASK)               /* ADC analog watchdog 1 interrupt */
#define ADC_CR1_JEOSIE_POS                  (7U)                               
#define ADC_CR1_JEOSIE_MASK                 (0x00000080)                       /* 0x00000080                                               */
#define ADC_CR1_JEOSIE                      (ADC_CR1_JEOSIE_MASK)              /* ADC group injected end of sequence conversions interrupt */
#define ADC_CR1_SCAN_POS                    (8U)                               
#define ADC_CR1_SCAN_MASK                   (0x00000100)                       /* 0x00000100    */
#define ADC_CR1_SCAN                        (ADC_CR1_SCAN_MASK)                /* ADC scan mode */
#define ADC_CR1_AWDSGL_POS                  (9U)                               
#define ADC_CR1_AWDSGL_MASK                 (0x00000200)                       /* 0x00000200                                                        */
#define ADC_CR1_AWDSGL                      (ADC_CR1_AWDSGL_MASK)              /* ADC analog watchdog 1 monitoring a single channel or all channels */
#define ADC_CR1_JAUTO_POS                   (10U)                              
#define ADC_CR1_JAUTO_MASK                  (0x00000400)                       /* 0x00000400                                */
#define ADC_CR1_JAUTO                       (ADC_CR1_JAUTO_MASK)               /* ADC group injected automatic trigger mode */
#define ADC_CR1_DISCEN_POS                  (11U)                              
#define ADC_CR1_DISCEN_MASK                 (0x00000800)                       /* 0x00000800                                     */
#define ADC_CR1_DISCEN                      (ADC_CR1_DISCEN_MASK)              /* ADC group regular sequencer discontinuous mode */
#define ADC_CR1_JDISCEN_POS                 (12U)                              
#define ADC_CR1_JDISCEN_MASK                (0x00001000)                       /* 0x00001000                                      */
#define ADC_CR1_JDISCEN                     (ADC_CR1_JDISCEN_MASK)             /* ADC group injected sequencer discontinuous mode */

#define ADC_CR1_DISCNUM_POS                 (13U)                              
#define ADC_CR1_DISCNUM_MASK                (0x0000E000)                       /* 0x0000E000                                                */
#define ADC_CR1_DISCNUM                     (ADC_CR1_DISCNUM_MASK)             /* ADC group regular sequencer discontinuous number of ranks */
#define ADC_CR1_DISCNUM_0                   (0x00002000)                       /* 0x00002000                                                */
#define ADC_CR1_DISCNUM_1                   (0x00004000)                       /* 0x00004000                                                */
#define ADC_CR1_DISCNUM_2                   (0x00008000)                       /* 0x00008000                                                */

#define ADC_CR1_DUALMOD_POS                 (16U)                              
#define ADC_CR1_DUALMOD_MASK                (0x000F0000)                       /* 0x000F0000                   */
#define ADC_CR1_DUALMOD                     (ADC_CR1_DUALMOD_MASK)             /* ADC multimode mode selection */
#define ADC_CR1_DUALMOD_0                   (0x00010000)                       /* 0x00010000                   */
#define ADC_CR1_DUALMOD_1                   (0x00020000)                       /* 0x00020000                   */
#define ADC_CR1_DUALMOD_2                   (0x00040000)                       /* 0x00040000                   */
#define ADC_CR1_DUALMOD_3                   (0x00080000)                       /* 0x00080000                   */

#define ADC_CR1_JAWDEN_POS                  (22U)                              
#define ADC_CR1_JAWDEN_MASK                 (0x00400000)                       /* 0x00400000                                               */
#define ADC_CR1_JAWDEN                      (ADC_CR1_JAWDEN_MASK)              /* ADC analog watchdog 1 enable on scope ADC group injected */
#define ADC_CR1_AWDEN_POS                   (23U)                              
#define ADC_CR1_AWDEN_MASK                  (0x00800000)                       /* 0x00800000                                              */
#define ADC_CR1_AWDEN                       (ADC_CR1_AWDEN_MASK)               /* ADC analog watchdog 1 enable on scope ADC group regular */

