dwgan/STKNX_ChargeStation/source/drivers/AD/STM32F10XX/include/Stm32F10XX_adc.h
/* Legacy defines */
#define  ADC_CR1_EOCIE                       (ADC_CR1_EOSIE)
#define  ADC_CR1_JEOCIE                      (ADC_CR1_JEOSIE)

/* Bit definition for ADC_CR2 register */
#define ADC_CR2_ADON_POS                    (0U)                               
#define ADC_CR2_ADON_MASK                   (0x00000001)                       /* 0x00000001                                   */
#define ADC_CR2_ADON                        (ADC_CR2_ADON_MASK)                /* ADC enable                                   */
#define ADC_CR2_CONT_POS                    (1U)                               
#define ADC_CR2_CONT_MASK                   (0x00000002)                       /* 0x00000002                                   */
#define ADC_CR2_CONT                        (ADC_CR2_CONT_MASK)                /* ADC group regular continuous conversion mode */
#define ADC_CR2_CAL_POS                     (2U)                               
#define ADC_CR2_CAL_MASK                    (0x00000004)                       /* 0x00000004            */
#define ADC_CR2_CAL                         (ADC_CR2_CAL_MASK)                 /* ADC calibration start */
#define ADC_CR2_RSTCAL_POS                  (3U)                               
#define ADC_CR2_RSTCAL_MASK                 (0x00000008)                       /* 0x00000008            */
#define ADC_CR2_RSTCAL                      (ADC_CR2_RSTCAL_MASK)              /* ADC calibration reset */
#define ADC_CR2_DMA_POS                     (8U)                               
#define ADC_CR2_DMA_MASK                    (0x00000100)                       /* 0x00000100              */
#define ADC_CR2_DMA                         (ADC_CR2_DMA_MASK)                 /* ADC DMA transfer enable */
#define ADC_CR2_ALIGN_POS                   (11U)                              
#define ADC_CR2_ALIGN_MASK                  (0x00000800)                       /* 0x00000800          */
#define ADC_CR2_ALIGN                       (ADC_CR2_ALIGN_MASK)               /* ADC data alignement */

#define ADC_CR2_JEXTSEL_POS                 (12U)                              
#define ADC_CR2_JEXTSEL_MASK                (0x00007000)                       /* 0x00007000                                 */
#define ADC_CR2_JEXTSEL                     (ADC_CR2_JEXTSEL_MASK)             /* ADC group injected external trigger source */
#define ADC_CR2_JEXTSEL_0                   (0x00001000)                       /* 0x00001000                                 */
#define ADC_CR2_JEXTSEL_1                   (0x00002000)                       /* 0x00002000                                 */
#define ADC_CR2_JEXTSEL_2                   (0x00004000)                       /* 0x00004000                                 */

#define ADC_CR2_JEXTTRIG_POS                (15U)                              
#define ADC_CR2_JEXTTRIG_MASK               (0x00008000)                       /* 0x00008000                                 */
#define ADC_CR2_JEXTTRIG                    (ADC_CR2_JEXTTRIG_MASK)            /* ADC group injected external trigger enable */

#define ADC_CR2_EXTSEL_POS                  (17U)                              
#define ADC_CR2_EXTSEL_MASK                 (0x000E0000)                       /* 0x000E0000                                */
#define ADC_CR2_EXTSEL                      (ADC_CR2_EXTSEL_MASK)              /* ADC group regular external trigger source */
#define ADC_CR2_EXTSEL_0                    (0x00020000)                       /* 0x00020000                                */
#define ADC_CR2_EXTSEL_1                    (0x00040000)                       /* 0x00040000                                */
#define ADC_CR2_EXTSEL_2                    (0x00080000)                       /* 0x00080000                                */

#define ADC_CR2_EXTSEL_SWSTART              (0x000E0000)                       /* 0x000E0000                                */

#define ADC_CR2_EXTTRIG_POS                 (20U)                              
#define ADC_CR2_EXTTRIG_MASK                (0x00100000)                       /* 0x00100000                                */
#define ADC_CR2_EXTTRIG                     (ADC_CR2_EXTTRIG_MASK)             /* ADC group regular external trigger enable */
#define ADC_CR2_JSWSTART_POS                (21U)                              
#define ADC_CR2_JSWSTART_MASK               (0x00200000)                       /* 0x00200000                          */
#define ADC_CR2_JSWSTART                    (ADC_CR2_JSWSTART_MASK)            /* ADC group injected conversion start */
#define ADC_CR2_SWSTART_POS                 (22U)                              
#define ADC_CR2_SWSTART_MASK                (0x00400000)                       /* 0x00400000                         */
#define ADC_CR2_SWSTART                     (ADC_CR2_SWSTART_MASK)             /* ADC group regular conversion start */
#define ADC_CR2_TSVREFE_POS                 (23U)                              
#define ADC_CR2_TSVREFE_MASK                (0x00800000)                       /* 0x00800000                                                 */
#define ADC_CR2_TSVREFE                     (ADC_CR2_TSVREFE_MASK)             /* ADC internal path to VrefInt and temperature sensor enable */

/* Bit definition for ADC_SMPR1 register */
#define ADC_SMPR1_SMP10_POS                 (0U)                               
#define ADC_SMPR1_SMP10_MASK                (0x00000007)                       /* 0x00000007                             */
#define ADC_SMPR1_SMP10                     (ADC_SMPR1_SMP10_MASK)             /* ADC channel 10 sampling time selection */
#define ADC_SMPR1_SMP10_0                   (0x00000001)                       /* 0x00000001                             */
#define ADC_SMPR1_SMP10_1                   (0x00000002)                       /* 0x00000002                             */
#define ADC_SMPR1_SMP10_2                   (0x00000004)                       /* 0x00000004                             */

#define ADC_SMPR1_SMP10_SEL(a)              ((a) << ADC_SMPR1_SMP10_POS)

