dwgan/STKNX_ChargeStation/source/drivers/AD/STM32F10XX/include/Stm32F10XX_adc.h
#define ADC_SMPR1_SMP11_POS                 (3U)                               
#define ADC_SMPR1_SMP11_MASK                (0x00000038)                       /* 0x00000038                             */
#define ADC_SMPR1_SMP11                     (ADC_SMPR1_SMP11_MASK)             /* ADC channel 11 sampling time selection */
#define ADC_SMPR1_SMP11_0                   (0x00000008)                       /* 0x00000008                             */
#define ADC_SMPR1_SMP11_1                   (0x00000010)                       /* 0x00000010                             */
#define ADC_SMPR1_SMP11_2                   (0x00000020)                       /* 0x00000020                             */

#define ADC_SMPR1_SMP11_SEL(a)              ((a) << ADC_SMPR1_SMP11_POS)

#define ADC_SMPR1_SMP12_POS                 (6U)                               
#define ADC_SMPR1_SMP12_MASK                (0x000001C0)                       /* 0x000001C0                              */
#define ADC_SMPR1_SMP12                     (ADC_SMPR1_SMP12_MASK)             /* ADC channel 12 sampling time selection  */
#define ADC_SMPR1_SMP12_0                   (0x00000040)                       /* 0x00000040                              */
#define ADC_SMPR1_SMP12_1                   (0x00000080)                       /* 0x00000080                              */
#define ADC_SMPR1_SMP12_2                   (0x00000100)                       /* 0x00000100                              */

#define ADC_SMPR1_SMP12_SEL(a)              ((a) << ADC_SMPR1_SMP12_POS)

#define ADC_SMPR1_SMP13_POS                 (9U)                               
#define ADC_SMPR1_SMP13_MASK                (0x00000E00)                       /* 0x00000E00                              */
#define ADC_SMPR1_SMP13                     (ADC_SMPR1_SMP13_MASK)             /* ADC channel 13 sampling time selection  */
#define ADC_SMPR1_SMP13_0                   (0x00000200)                       /* 0x00000200                              */
#define ADC_SMPR1_SMP13_1                   (0x00000400)                       /* 0x00000400                              */
#define ADC_SMPR1_SMP13_2                   (0x00000800)                       /* 0x00000800                              */

#define ADC_SMPR1_SMP13_SEL(a)              ((a) << ADC_SMPR1_SMP13_POS)

#define ADC_SMPR1_SMP14_POS                 (12U)                              
#define ADC_SMPR1_SMP14_MASK                (0x00007000)                       /* 0x00007000                              */
#define ADC_SMPR1_SMP14                     (ADC_SMPR1_SMP14_MASK)             /* ADC channel 14 sampling time selection  */
#define ADC_SMPR1_SMP14_0                   (0x00001000)                       /* 0x00001000                              */
#define ADC_SMPR1_SMP14_1                   (0x00002000)                       /* 0x00002000                              */
#define ADC_SMPR1_SMP14_2                   (0x00004000)                       /* 0x00004000                              */

#define ADC_SMPR1_SMP14_SEL(a)              ((a) << ADC_SMPR1_SMP14_POS)

#define ADC_SMPR1_SMP15_POS                 (15U)                              
#define ADC_SMPR1_SMP15_MASK                (0x00038000)                       /* 0x00038000 */
#define ADC_SMPR1_SMP15                     (ADC_SMPR1_SMP15_MASK)             /* ADC channel 15 sampling time selection  */
#define ADC_SMPR1_SMP15_0                   (0x00008000)                       /* 0x00008000                              */
#define ADC_SMPR1_SMP15_1                   (0x00010000)                       /* 0x00010000                              */
#define ADC_SMPR1_SMP15_2                   (0x00020000)                       /* 0x00020000                              */

#define ADC_SMPR1_SMP15_SEL(a)              ((a) << ADC_SMPR1_SMP15_POS)

#define ADC_SMPR1_SMP16_POS                 (18U)                              
#define ADC_SMPR1_SMP16_MASK                (0x001C0000)                       /* 0x001C0000 */
#define ADC_SMPR1_SMP16                     (ADC_SMPR1_SMP16_MASK)             /* ADC channel 16 sampling time selection  */
#define ADC_SMPR1_SMP16_0                   (0x00040000)                       /* 0x00040000                              */
#define ADC_SMPR1_SMP16_1                   (0x00080000)                       /* 0x00080000                              */
#define ADC_SMPR1_SMP16_2                   (0x00100000)                       /* 0x00100000                              */

#define ADC_SMPR1_SMP16_SEL(a)              ((a) << ADC_SMPR1_SMP16_POS)

#define ADC_SMPR1_SMP17_POS                 (21U)                              
#define ADC_SMPR1_SMP17_MASK                (0x00E00000)                       /* 0x00E00000                              */
#define ADC_SMPR1_SMP17                     (ADC_SMPR1_SMP17_MASK)             /* ADC channel 17 sampling time selection  */
#define ADC_SMPR1_SMP17_0                   (0x00200000)                       /* 0x00200000                              */
#define ADC_SMPR1_SMP17_1                   (0x00400000)                       /* 0x00400000                              */
#define ADC_SMPR1_SMP17_2                   (0x00800000)                       /* 0x00800000                              */

#define ADC_SMPR1_SMP17_SEL(a)              ((a) << ADC_SMPR1_SMP17_POS)        

/* Bit definition for ADC_SMPR2 register */
#define ADC_SMPR2_SMP0_POS                  (0U)                               
#define ADC_SMPR2_SMP0_MASK                 (0x00000007)                       /* 0x00000007                              */
#define ADC_SMPR2_SMP0                      (ADC_SMPR2_SMP0_MASK)              /* ADC channel 0 sampling time selection   */
#define ADC_SMPR2_SMP0_0                    (0x00000001)                       /* 0x00000001                              */
#define ADC_SMPR2_SMP0_1                    (0x00000002)                       /* 0x00000002                              */
#define ADC_SMPR2_SMP0_2                    (0x00000004)                       /* 0x00000004                              */

