dwgan/STKNX_ChargeStation/source/drivers/AD/STM32F10XX/include/Stm32F10XX_adc.h
#define ADC_SMPR2_SMP0_SEL(a)               ((a) << ADC_SMPR2_SMP0_POS)        

#define ADC_SMPR2_SMP1_POS                  (3U)                               
#define ADC_SMPR2_SMP1_MASK                 (0x00000038)                       /* 0x00000038 */
#define ADC_SMPR2_SMP1                      (ADC_SMPR2_SMP1_MASK)              /* ADC channel 1 sampling time selection   */
#define ADC_SMPR2_SMP1_0                    (0x00000008)                       /* 0x00000008                              */
#define ADC_SMPR2_SMP1_1                    (0x00000010)                       /* 0x00000010                              */
#define ADC_SMPR2_SMP1_2                    (0x00000020)                       /* 0x00000020                              */

#define ADC_SMPR2_SMP1_SEL(a)               ((a) << ADC_SMPR2_SMP1_POS)        

#define ADC_SMPR2_SMP2_POS                  (6U)                               
#define ADC_SMPR2_SMP2_MASK                 (0x000001C0)                       /* 0x000001C0                              */
#define ADC_SMPR2_SMP2                      (ADC_SMPR2_SMP2_MASK)              /* ADC channel 2 sampling time selection   */
#define ADC_SMPR2_SMP2_0                    (0x00000040)                       /* 0x00000040                              */
#define ADC_SMPR2_SMP2_1                    (0x00000080)                       /* 0x00000080                              */
#define ADC_SMPR2_SMP2_2                    (0x00000100)                       /* 0x00000100                              */

#define ADC_SMPR2_SMP2_SEL(a)               ((a) << ADC_SMPR2_SMP2_POS)        

#define ADC_SMPR2_SMP3_POS                  (9U)                               
#define ADC_SMPR2_SMP3_MASK                 (0x00000E00)                       /* 0x00000E00                              */
#define ADC_SMPR2_SMP3                      (ADC_SMPR2_SMP3_MASK)              /* ADC channel 3 sampling time selection   */
#define ADC_SMPR2_SMP3_0                    (0x00000200)                       /* 0x00000200                              */
#define ADC_SMPR2_SMP3_1                    (0x00000400)                       /* 0x00000400                              */
#define ADC_SMPR2_SMP3_2                    (0x00000800)                       /* 0x00000800                              */

#define ADC_SMPR2_SMP3_SEL(a)               ((a) << ADC_SMPR2_SMP3_POS)        

#define ADC_SMPR2_SMP4_POS                  (12U)                              
#define ADC_SMPR2_SMP4_MASK                 (0x00007000)                       /* 0x00007000                              */
#define ADC_SMPR2_SMP4                      (ADC_SMPR2_SMP4_MASK)              /* ADC channel 4 sampling time selection   */
#define ADC_SMPR2_SMP4_0                    (0x00001000)                       /* 0x00001000                              */
#define ADC_SMPR2_SMP4_1                    (0x00002000)                       /* 0x00002000                              */
#define ADC_SMPR2_SMP4_2                    (0x00004000)                       /* 0x00004000                              */

#define ADC_SMPR2_SMP4_SEL(a)               ((a) << ADC_SMPR2_SMP4_POS)        

#define ADC_SMPR2_SMP5_POS                  (15U)                              
#define ADC_SMPR2_SMP5_MASK                 (0x00038000)                       /* 0x00038000                              */
#define ADC_SMPR2_SMP5                      (ADC_SMPR2_SMP5_MASK)              /* ADC channel 5 sampling time selection   */
#define ADC_SMPR2_SMP5_0                    (0x00008000)                       /* 0x00008000                              */
#define ADC_SMPR2_SMP5_1                    (0x00010000)                       /* 0x00010000                              */
#define ADC_SMPR2_SMP5_2                    (0x00020000)                       /* 0x00020000                              */

#define ADC_SMPR2_SMP5_SEL(a)               ((a) << ADC_SMPR2_SMP5_POS)        

#define ADC_SMPR2_SMP6_POS                  (18U)                              
#define ADC_SMPR2_SMP6_MASK                 (0x001C0000)                       /* 0x001C0000                              */
#define ADC_SMPR2_SMP6                      (ADC_SMPR2_SMP6_MASK)              /* ADC channel 6 sampling time selection   */
#define ADC_SMPR2_SMP6_0                    (0x00040000)                       /* 0x00040000                              */
#define ADC_SMPR2_SMP6_1                    (0x00080000)                       /* 0x00080000                              */
#define ADC_SMPR2_SMP6_2                    (0x00100000)                       /* 0x00100000                              */

#define ADC_SMPR2_SMP6_SEL(a)               ((a) << ADC_SMPR2_SMP6_POS)        

#define ADC_SMPR2_SMP7_POS                  (21U)                              
#define ADC_SMPR2_SMP7_MASK                 (0x00E00000)                       /* 0x00E00000                              */
#define ADC_SMPR2_SMP7                      (ADC_SMPR2_SMP7_MASK)              /* ADC channel 7 sampling time selection   */
#define ADC_SMPR2_SMP7_0                    (0x00200000)                       /* 0x00200000                              */
#define ADC_SMPR2_SMP7_1                    (0x00400000)                       /* 0x00400000                              */
#define ADC_SMPR2_SMP7_2                    (0x00800000)                       /* 0x00800000                              */

#define ADC_SMPR2_SMP7_SEL(a)               ((a) << ADC_SMPR2_SMP7_POS)        

#define ADC_SMPR2_SMP8_POS                  (24U)                              
#define ADC_SMPR2_SMP8_MASK                 (0x07000000)                       /* 0x07000000                              */
#define ADC_SMPR2_SMP8                      (ADC_SMPR2_SMP8_MASK)              /* ADC channel 8 sampling time selection   */
#define ADC_SMPR2_SMP8_0                    (0x01000000)                       /* 0x01000000                              */
#define ADC_SMPR2_SMP8_1                    (0x02000000)                       /* 0x02000000                              */
#define ADC_SMPR2_SMP8_2                    (0x04000000)                       /* 0x04000000                              */

#define ADC_SMPR2_SMP8_SEL(a)               ((a) << ADC_SMPR2_SMP8_POS)        

#define ADC_SMPR2_SMP9_POS                  (27U)                              
#define ADC_SMPR2_SMP9_MASK                 (0x38000000)                       /* 0x38000000                              */
#define ADC_SMPR2_SMP9                      (ADC_SMPR2_SMP9_MASK)              /* ADC channel 9 sampling time selection   */
#define ADC_SMPR2_SMP9_0                    (0x08000000)                       /* 0x08000000                              */
#define ADC_SMPR2_SMP9_1                    (0x10000000)                       /* 0x10000000                              */
#define ADC_SMPR2_SMP9_2                    (0x20000000)                       /* 0x20000000                              */

#define ADC_SMPR2_SMP9_SEL(a)               ((a) << ADC_SMPR2_SMP9_POS)        

/* Bit definition for ADC_JOFR1 register */
#define ADC_JOFR1_JOFFSET1_POS              (0U)                               
#define ADC_JOFR1_JOFFSET1_MASK             (0x00000FFF)                       /* 0x00000FFF                                       */
#define ADC_JOFR1_JOFFSET1                  (ADC_JOFR1_JOFFSET1_MASK)          /* ADC group injected sequencer rank 1 offset value */

/* Bit definition for ADC_JOFR2 register */
#define ADC_JOFR2_JOFFSET2_POS              (0U)                               
#define ADC_JOFR2_JOFFSET2_MASK             (0x00000FFF)                       /* 0x00000FFF                                       */
#define ADC_JOFR2_JOFFSET2                  (ADC_JOFR2_JOFFSET2_MASK)          /* ADC group injected sequencer rank 2 offset value */

/* Bit definition for ADC_JOFR3 register */
#define ADC_JOFR3_JOFFSET3_POS              (0U)                               
#define ADC_JOFR3_JOFFSET3_MASK             (0x00000FFF)                       /* 0x00000FFF                                       */
#define ADC_JOFR3_JOFFSET3                  (ADC_JOFR3_JOFFSET3_MASK)          /* ADC group injected sequencer rank 3 offset value */

/* Bit definition for ADC_JOFR4 register */
#define ADC_JOFR4_JOFFSET4_POS              (0U)                               
#define ADC_JOFR4_JOFFSET4_MASK             (0x00000FFF)                       /* 0x00000FFF                                       */
#define ADC_JOFR4_JOFFSET4                  (ADC_JOFR4_JOFFSET4_MASK)          /* ADC group injected sequencer rank 4 offset value */

/* Bit definition for ADC_HTR register */
#define ADC_HTR_HT_POS                      (0U)                               
#define ADC_HTR_HT_MASK                     (0x00000FFF)                       /* 0x00000FFF                           */
#define ADC_HTR_HT                          (ADC_HTR_HT_MASK)                  /* ADC analog watchdog 1 threshold high */

/* Bit definition for ADC_LTR register */
#define ADC_LTR_LT_POS                      (0U)                               
#define ADC_LTR_LT_MASK                     (0x00000FFF)                       /* 0x00000FFF                          */
#define ADC_LTR_LT                          (ADC_LTR_LT_MASK)                  /* ADC analog watchdog 1 threshold low */

/* Bit definition for ADC_SQR1 register */
#define ADC_SQR1_SQ13_POS                   (0U)                               
#define ADC_SQR1_SQ13_MASK                  (0x0000001F)                       /* 0x0000001F                          */
#define ADC_SQR1_SQ13                       (ADC_SQR1_SQ13_MASK)               /* ADC group regular sequencer rank 13 */
#define ADC_SQR1_SQ13_0                     (0x00000001)                       /* 0x00000001                          */
#define ADC_SQR1_SQ13_1                     (0x00000002)                       /* 0x00000002                          */
#define ADC_SQR1_SQ13_2                     (0x00000004)                       /* 0x00000004                          */
#define ADC_SQR1_SQ13_3                     (0x00000008)                       /* 0x00000008                          */
#define ADC_SQR1_SQ13_4                     (0x00000010)                       /* 0x00000010                          */

#define ADC_SQR1_SQ14_POS                   (5U)                               
#define ADC_SQR1_SQ14_MASK                  (0x000003E0)                       /* 0x000003E0                          */
#define ADC_SQR1_SQ14                       (ADC_SQR1_SQ14_MASK)               /* ADC group regular sequencer rank 14 */
#define ADC_SQR1_SQ14_0                     (0x00000020)                       /* 0x00000020                          */
#define ADC_SQR1_SQ14_1                     (0x00000040)                       /* 0x00000040                          */
#define ADC_SQR1_SQ14_2                     (0x00000080)                       /* 0x00000080                          */
#define ADC_SQR1_SQ14_3                     (0x00000100)                       /* 0x00000100                          */
#define ADC_SQR1_SQ14_4                     (0x00000200)                       /* 0x00000200                          */

#define ADC_SQR1_SQ15_POS                   (10U)                              
#define ADC_SQR1_SQ15_MASK                  (0x00007C00)                       /* 0x00007C00                          */
#define ADC_SQR1_SQ15                       (ADC_SQR1_SQ15_MASK)               /* ADC group regular sequencer rank 15 */
#define ADC_SQR1_SQ15_0                     (0x00000400)                       /* 0x00000400                          */
#define ADC_SQR1_SQ15_1                     (0x00000800)                       /* 0x00000800                          */
#define ADC_SQR1_SQ15_2                     (0x00001000)                       /* 0x00001000                          */
#define ADC_SQR1_SQ15_3                     (0x00002000)                       /* 0x00002000                          */
#define ADC_SQR1_SQ15_4                     (0x00004000)                       /* 0x00004000                          */

#define ADC_SQR1_SQ16_POS                   (15U)                              
#define ADC_SQR1_SQ16_MASK                  (0x000F8000)                       /* 0x000F8000                          */
#define ADC_SQR1_SQ16                       (ADC_SQR1_SQ16_MASK)               /* ADC group regular sequencer rank 16 */
#define ADC_SQR1_SQ16_0                     (0x00008000)                       /* 0x00008000                          */
#define ADC_SQR1_SQ16_1                     (0x00010000)                       /* 0x00010000                          */
#define ADC_SQR1_SQ16_2                     (0x00020000)                       /* 0x00020000                          */
#define ADC_SQR1_SQ16_3                     (0x00040000)                       /* 0x00040000                          */
#define ADC_SQR1_SQ16_4                     (0x00080000)                       /* 0x00080000                          */

#define ADC_SQR1_L_POS                      (20U)                              
#define ADC_SQR1_L_MASK                     (0x00F00000)                       /* 0x00F00000                              */
#define ADC_SQR1_L                          (ADC_SQR1_L_MASK)                  /* ADC group regular sequencer scan length */
#define ADC_SQR1_L_0                        (0x00100000)                       /* 0x00100000                              */
#define ADC_SQR1_L_1                        (0x00200000)                       /* 0x00200000                              */
#define ADC_SQR1_L_2                        (0x00400000)                       /* 0x00400000                              */
#define ADC_SQR1_L_3                        (0x00800000)                       /* 0x00800000                              */

/* Bit definition for ADC_SQR2 register */
#define ADC_SQR2_SQ7_POS                    (0U)                               
#define ADC_SQR2_SQ7_MASK                   (0x0000001F)                       /* 0x0000001F                          */
#define ADC_SQR2_SQ7                        (ADC_SQR2_SQ7_MASK)                /* ADC group regular sequencer rank 7  */
#define ADC_SQR2_SQ7_0                      (0x00000001)                       /* 0x00000001                          */
#define ADC_SQR2_SQ7_1                      (0x00000002)                       /* 0x00000002                          */
#define ADC_SQR2_SQ7_2                      (0x00000004)                       /* 0x00000004                          */
#define ADC_SQR2_SQ7_3                      (0x00000008)                       /* 0x00000008                          */
#define ADC_SQR2_SQ7_4                      (0x00000010)                       /* 0x00000010                          */

#define ADC_SQR2_SQ8_POS                    (5U)                               
#define ADC_SQR2_SQ8_MASK                   (0x000003E0)                       /* 0x000003E0                          */
#define ADC_SQR2_SQ8                        (ADC_SQR2_SQ8_MASK)                /* ADC group regular sequencer rank 8  */
#define ADC_SQR2_SQ8_0                      (0x00000020)                       /* 0x00000020                          */
#define ADC_SQR2_SQ8_1                      (0x00000040)                       /* 0x00000040                          */
#define ADC_SQR2_SQ8_2                      (0x00000080)                       /* 0x00000080                          */
#define ADC_SQR2_SQ8_3                      (0x00000100)                       /* 0x00000100                          */
#define ADC_SQR2_SQ8_4                      (0x00000200)                       /* 0x00000200                          */

#define ADC_SQR2_SQ9_POS                    (10U)                              
#define ADC_SQR2_SQ9_MASK                   (0x00007C00)                       /* 0x00007C00                          */
#define ADC_SQR2_SQ9                        (ADC_SQR2_SQ9_MASK)                /* ADC group regular sequencer rank 9  */
#define ADC_SQR2_SQ9_0                      (0x00000400)                       /* 0x00000400                          */
#define ADC_SQR2_SQ9_1                      (0x00000800)                       /* 0x00000800                          */
#define ADC_SQR2_SQ9_2                      (0x00001000)                       /* 0x00001000                          */
#define ADC_SQR2_SQ9_3                      (0x00002000)                       /* 0x00002000                          */
#define ADC_SQR2_SQ9_4                      (0x00004000)                       /* 0x00004000                          */

#define ADC_SQR2_SQ10_POS                   (15U)                              
#define ADC_SQR2_SQ10_MASK                  (0x000F8000)                       /* 0x000F8000                          */
#define ADC_SQR2_SQ10                       (ADC_SQR2_SQ10_MASK)               /* ADC group regular sequencer rank 10 */
#define ADC_SQR2_SQ10_0                     (0x00008000)                       /* 0x00008000                          */
#define ADC_SQR2_SQ10_1                     (0x00010000)                       /* 0x00010000                          */
#define ADC_SQR2_SQ10_2                     (0x00020000)                       /* 0x00020000                          */
#define ADC_SQR2_SQ10_3                     (0x00040000)                       /* 0x00040000                          */
#define ADC_SQR2_SQ10_4                     (0x00080000)                       /* 0x00080000                          */

#define ADC_SQR2_SQ11_POS                   (20U)                              
#define ADC_SQR2_SQ11_MASK                  (0x01F00000)                       /* 0x01F00000                          */
#define ADC_SQR2_SQ11                       (ADC_SQR2_SQ11_MASK)               /* ADC group regular sequencer rank 11 */
#define ADC_SQR2_SQ11_0                     (0x00100000)                       /* 0x00100000                          */
#define ADC_SQR2_SQ11_1                     (0x00200000)                       /* 0x00200000                          */
#define ADC_SQR2_SQ11_2                     (0x00400000)                       /* 0x00400000                          */
#define ADC_SQR2_SQ11_3                     (0x00800000)                       /* 0x00800000                          */
#define ADC_SQR2_SQ11_4                     (0x01000000)                       /* 0x01000000                          */

