dwgan/STKNX_ChargeStation/source/drivers/AD/STM32F10XX/include/Stm32F10XX_adc.h
#define ADC_SQR2_SQ12_POS                   (25U)                              
#define ADC_SQR2_SQ12_MASK                  (0x3E000000)                       /* 0x3E000000                          */
#define ADC_SQR2_SQ12                       (ADC_SQR2_SQ12_MASK)               /* ADC group regular sequencer rank 12 */
#define ADC_SQR2_SQ12_0                     (0x02000000)                       /* 0x02000000                          */
#define ADC_SQR2_SQ12_1                     (0x04000000)                       /* 0x04000000                          */
#define ADC_SQR2_SQ12_2                     (0x08000000)                       /* 0x08000000                          */
#define ADC_SQR2_SQ12_3                     (0x10000000)                       /* 0x10000000                          */
#define ADC_SQR2_SQ12_4                     (0x20000000)                       /* 0x20000000                          */

/* Bit definition for ADC_SQR3 register */
#define ADC_SQR3_SQ1_POS                    (0U)                               
#define ADC_SQR3_SQ1_MASK                   (0x0000001F)                       /* 0x0000001F                          */
#define ADC_SQR3_SQ1                        (ADC_SQR3_SQ1_MASK)                /* ADC group regular sequencer rank 1  */
#define ADC_SQR3_SQ1_0                      (0x00000001)                       /* 0x00000001                          */
#define ADC_SQR3_SQ1_1                      (0x00000002)                       /* 0x00000002                          */
#define ADC_SQR3_SQ1_2                      (0x00000004)                       /* 0x00000004                          */
#define ADC_SQR3_SQ1_3                      (0x00000008)                       /* 0x00000008                          */
#define ADC_SQR3_SQ1_4                      (0x00000010)                       /* 0x00000010                          */

#define ADC_SQR3_SQ2_POS                    (5U)                               
#define ADC_SQR3_SQ2_MASK                   (0x000003E0)                       /* 0x000003E0                          */
#define ADC_SQR3_SQ2                        (ADC_SQR3_SQ2_MASK)                /* ADC group regular sequencer rank 2  */
#define ADC_SQR3_SQ2_0                      (0x00000020)                       /* 0x00000020                          */
#define ADC_SQR3_SQ2_1                      (0x00000040)                       /* 0x00000040                          */
#define ADC_SQR3_SQ2_2                      (0x00000080)                       /* 0x00000080                          */
#define ADC_SQR3_SQ2_3                      (0x00000100)                       /* 0x00000100                          */
#define ADC_SQR3_SQ2_4                      (0x00000200)                       /* 0x00000200                          */

#define ADC_SQR3_SQ3_POS                    (10U)                              
#define ADC_SQR3_SQ3_MASK                   (0x00007C00)                       /* 0x00007C00                          */
#define ADC_SQR3_SQ3                        (ADC_SQR3_SQ3_MASK)                /* ADC group regular sequencer rank 3  */
#define ADC_SQR3_SQ3_0                      (0x00000400)                       /* 0x00000400                          */
#define ADC_SQR3_SQ3_1                      (0x00000800)                       /* 0x00000800                          */
#define ADC_SQR3_SQ3_2                      (0x00001000)                       /* 0x00001000                          */
#define ADC_SQR3_SQ3_3                      (0x00002000)                       /* 0x00002000                          */
#define ADC_SQR3_SQ3_4                      (0x00004000)                       /* 0x00004000                          */

#define ADC_SQR3_SQ4_POS                    (15U)                              
#define ADC_SQR3_SQ4_MASK                   (0x000F8000)                       /* 0x000F8000                          */
#define ADC_SQR3_SQ4                        (ADC_SQR3_SQ4_MASK)                /* ADC group regular sequencer rank 4  */
#define ADC_SQR3_SQ4_0                      (0x00008000)                       /* 0x00008000                          */
#define ADC_SQR3_SQ4_1                      (0x00010000)                       /* 0x00010000                          */
#define ADC_SQR3_SQ4_2                      (0x00020000)                       /* 0x00020000                          */
#define ADC_SQR3_SQ4_3                      (0x00040000)                       /* 0x00040000                          */
#define ADC_SQR3_SQ4_4                      (0x00080000)                       /* 0x00080000                          */

#define ADC_SQR3_SQ5_POS                    (20U)                              
#define ADC_SQR3_SQ5_MASK                   (0x01F00000)                       /* 0x01F00000                          */
#define ADC_SQR3_SQ5                        (ADC_SQR3_SQ5_MASK)                /* ADC group regular sequencer rank 5  */
#define ADC_SQR3_SQ5_0                      (0x00100000)                       /* 0x00100000                          */
#define ADC_SQR3_SQ5_1                      (0x00200000)                       /* 0x00200000                          */
#define ADC_SQR3_SQ5_2                      (0x00400000)                       /* 0x00400000                          */
#define ADC_SQR3_SQ5_3                      (0x00800000)                       /* 0x00800000                          */
#define ADC_SQR3_SQ5_4                      (0x01000000)                       /* 0x01000000                          */

#define ADC_SQR3_SQ6_POS                    (25U)                              
#define ADC_SQR3_SQ6_MASK                   (0x3E000000)                       /* 0x3E000000                          */
#define ADC_SQR3_SQ6                        (ADC_SQR3_SQ6_MASK)                /* ADC group regular sequencer rank 6  */
#define ADC_SQR3_SQ6_0                      (0x02000000)                       /* 0x02000000                          */
#define ADC_SQR3_SQ6_1                      (0x04000000)                       /* 0x04000000                          */
#define ADC_SQR3_SQ6_2                      (0x08000000)                       /* 0x08000000                          */
#define ADC_SQR3_SQ6_3                      (0x10000000)                       /* 0x10000000                          */
#define ADC_SQR3_SQ6_4                      (0x20000000)                       /* 0x20000000                          */

/* Bit definition for ADC_JSQR register */
#define ADC_JSQR_JSQ1_POS                   (0U)                               
#define ADC_JSQR_JSQ1_MASK                  (0x0000001F)                       /* 0x0000001F                          */
#define ADC_JSQR_JSQ1                       (ADC_JSQR_JSQ1_MASK)               /* ADC group injected sequencer rank 1 */
#define ADC_JSQR_JSQ1_0                     (0x00000001)                       /* 0x00000001                          */
#define ADC_JSQR_JSQ1_1                     (0x00000002)                       /* 0x00000002                          */
#define ADC_JSQR_JSQ1_2                     (0x00000004)                       /* 0x00000004                          */
#define ADC_JSQR_JSQ1_3                     (0x00000008)                       /* 0x00000008                          */
#define ADC_JSQR_JSQ1_4                     (0x00000010)                       /* 0x00000010                          */

#define ADC_JSQR_JSQ2_POS                   (5U)                               
#define ADC_JSQR_JSQ2_MASK                  (0x000003E0)                       /* 0x000003E0                          */
#define ADC_JSQR_JSQ2                       (ADC_JSQR_JSQ2_MASK)               /* ADC group injected sequencer rank 2 */
#define ADC_JSQR_JSQ2_0                     (0x00000020)                       /* 0x00000020                          */
#define ADC_JSQR_JSQ2_1                     (0x00000040)                       /* 0x00000040                          */
#define ADC_JSQR_JSQ2_2                     (0x00000080)                       /* 0x00000080                          */
#define ADC_JSQR_JSQ2_3                     (0x00000100)                       /* 0x00000100                          */
#define ADC_JSQR_JSQ2_4                     (0x00000200)                       /* 0x00000200                          */

#define ADC_JSQR_JSQ3_POS                   (10U)                              
#define ADC_JSQR_JSQ3_MASK                  (0x00007C00)                       /* 0x00007C00                          */
#define ADC_JSQR_JSQ3                       (ADC_JSQR_JSQ3_MASK)               /* ADC group injected sequencer rank 3 */
#define ADC_JSQR_JSQ3_0                     (0x00000400)                       /* 0x00000400                          */
#define ADC_JSQR_JSQ3_1                     (0x00000800)                       /* 0x00000800                          */
#define ADC_JSQR_JSQ3_2                     (0x00001000)                       /* 0x00001000                          */
#define ADC_JSQR_JSQ3_3                     (0x00002000)                       /* 0x00002000                          */
#define ADC_JSQR_JSQ3_4                     (0x00004000)                       /* 0x00004000                          */

#define ADC_JSQR_JSQ4_POS                   (15U)                              
#define ADC_JSQR_JSQ4_MASK                  (0x000F8000)                       /* 0x000F8000                          */
#define ADC_JSQR_JSQ4                       (ADC_JSQR_JSQ4_MASK)               /* ADC group injected sequencer rank 4 */
#define ADC_JSQR_JSQ4_0                     (0x00008000)                       /* 0x00008000                          */
#define ADC_JSQR_JSQ4_1                     (0x00010000)                       /* 0x00010000                          */
#define ADC_JSQR_JSQ4_2                     (0x00020000)                       /* 0x00020000                          */
#define ADC_JSQR_JSQ4_3                     (0x00040000)                       /* 0x00040000                          */
#define ADC_JSQR_JSQ4_4                     (0x00080000)                       /* 0x00080000                          */

#define ADC_JSQR_JL_POS                     (20U)                              
#define ADC_JSQR_JL_MASK                    (0x00300000)                       /* 0x00300000                               */
#define ADC_JSQR_JL                         (ADC_JSQR_JL_MASK)                 /* ADC group injected sequencer scan length */
#define ADC_JSQR_JL_0                       (0x00100000)                       /* 0x00100000                               */
#define ADC_JSQR_JL_1                       (0x00200000)                       /* 0x00200000                               */

/* Bit definition for ADC_JDR1 register */
#define ADC_JDR1_JDATA_POS                  (0U)                               
#define ADC_JDR1_JDATA_MASK                 (0x0000FFFF)                       /* 0x0000FFFF                                          */
#define ADC_JDR1_JDATA                      (ADC_JDR1_JDATA_MASK)              /* ADC group injected sequencer rank 1 conversion data */

/* Bit definition for ADC_JDR2 register */
#define ADC_JDR2_JDATA_POS                  (0U)                               
#define ADC_JDR2_JDATA_MASK                 (0x0000FFFF)                       /* 0x0000FFFF                                          */
#define ADC_JDR2_JDATA                      (ADC_JDR2_JDATA_MASK)              /* ADC group injected sequencer rank 2 conversion data */

/* Bit definition for ADC_JDR3 register */
#define ADC_JDR3_JDATA_POS                  (0U)                               
#define ADC_JDR3_JDATA_MASK                 (0x0000FFFF)                       /* 0x0000FFFF                                          */
#define ADC_JDR3_JDATA                      (ADC_JDR3_JDATA_MASK)              /* ADC group injected sequencer rank 3 conversion data */

/* Bit definition for ADC_JDR4 register */
#define ADC_JDR4_JDATA_POS                  (0U)                               
#define ADC_JDR4_JDATA_MASK                 (0x0000FFFF)                       /* 0x0000FFFF                                          */
#define ADC_JDR4_JDATA                      (ADC_JDR4_JDATA_MASK)              /* ADC group injected sequencer rank 4 conversion data */

/** Bit definition for ADC_DR register */
#define ADC_DR_DATA_POS                     (0U)                               
#define ADC_DR_DATA_MASK                    (0x0000FFFF)                       /* 0x0000FFFF                        */
#define ADC_DR_DATA                         (ADC_DR_DATA_MASK)                 /* ADC group regular conversion data */
#define ADC_DR_ADC2DATA_POS                 (16U)                              
#define ADC_DR_ADC2DATA_MASK                (0xFFFF0000)                       /* 0xFFFF0000                                                    */
#define ADC_DR_ADC2DATA                     (ADC_DR_ADC2DATA_MASK)             /* ADC group regular conversion data for ADC slave, in multimode */




/* Data structure definition */
/****************************************************
*   Structure£º  T_ADC_MEM_MAP
*   Description£ºMemory map of ADC registers.
*   Parameter:   WORD32 SR         Status register   
*                WORD32 CR1        Control register 1                    
*                WORD32 CR2        Control regitset 2                    
*                WORD32 SMPR1      Sample time register 1                
*                WORD32 SMPR2      Sample time register 2                
*                WORD32 JOFR1      Inject channel data offset register 1 
*                WORD32 JOFR2      Inject channel data offset register 2 
*                WORD32 JOFR3      Inject channel data offset register 3 
*                WORD32 JOFR4      Inject channel data offset register 4 
*                WORD32 HTR        Watchdog high threshold register 1    
*                WORD32 LTR        Watchdog low threshold register 2     
*                WORD32 SQR1       Regular sequence register 1           
*                WORD32 SQR2       Regular sequence register 2           
*                WORD32 SQR3       Regular sequence register 3           
*                WORD32 JSQR       Inject sequence register              
*                WORD32 JDR1       Inject data register 1                
*                WORD32 JDR2       Inject data register 2                
*                WORD32 JDR3       Inject data register 3                
*                WORD32 JDR4       Inject data register 4                
*                WORD32 DR         Regular data register   
*   Authour£º    Ian
*   Modify record:
*   Date:  2016-7-31 creat.
****************************************************/
typedef struct _T_ADC_MEM_MAP
{
    WORD32 SR;        /* Status register                       */
    WORD32 CR1;       /* Control register 1                    */
    WORD32 CR2;       /* Control regitset 2                    */
    WORD32 SMPR1;     /* Sample time register 1                */
    WORD32 SMPR2;     /* Sample time register 2                */
    WORD32 JOFR1;     /* Inject channel data offset register 1 */
    WORD32 JOFR2;     /* Inject channel data offset register 2 */
    WORD32 JOFR3;     /* Inject channel data offset register 3 */
    WORD32 JOFR4;     /* Inject channel data offset register 4 */
    WORD32 HTR;       /* Watchdog high threshold register 1    */
    WORD32 LTR;       /* Watchdog low threshold register 2     */
    WORD32 SQR1;      /* Regular sequence register 1           */
    WORD32 SQR2;      /* Regular sequence register 2           */
    WORD32 SQR3;      /* Regular sequence register 3           */
    WORD32 JSQR;      /* Inject sequence register              */
    WORD32 JDR1;      /* Inject data register 1                */
    WORD32 JDR2;      /* Inject data register 2                */
    WORD32 JDR3;      /* Inject data register 3                */
    WORD32 JDR4;      /* Inject data register 4                */
    WORD32 DR;        /* Regular data register                 */
}volatile *T_ADC_MEM_MAP;



/* Declaration of functions */
/**************************************************************************
* Funciton: void ADC_Reg(BYTE ucLogNo, BYTE ucDevNo, VOID *ptPara)
* Descrip.: Register ADC
* Input   : BYTE ucLogNo      Device logic No.
*           BYTE ucDevNo      Device physical No.
*           VOID *ptPara      None
* Output  : None
* Return  : None
* Note    : None
* Date             Version     Author        Content
* -----------------------------------------------
* 2016/07/31       V1.0         Ian          Create 
**************************************************************************/
void ADC_Reg(BYTE ucLogNo, BYTE ucDevNo, VOID *ptPara);



#ifdef __cplusplus
}
#endif

#endif /* STM32F10XX_H_ */



